# Taps
tap "common-fate/granted"
tap "common-fate/tap"
tap "infisical/get-cli"
tap "nikitabobko/tap"
tap "FelixKratz/formulae"

# Terminal & Shell
brew "zsh-autosuggestions"    # Fish-like suggestions for zsh
brew "zsh-syntax-highlighting" # Syntax highlighting for zsh
brew "git"               # Up-to-date git (replaces macOS default)
brew "curl"              # Up-to-date curl (replaces macOS default)
brew "starship"          # Cross-shell prompt
brew "fzf"               # Fuzzy finder
brew "zoxide"            # Smarter cd
brew "bat"               # cat with syntax highlighting
brew "eza"               # Modern ls replacement
brew "ripgrep"           # Fast grep
brew "fx"                # JSON viewer
brew "jq"                # JSON processor
brew "yq"                # jq for YAML
brew "fd"                # Modern find replacement
brew "tmux"              # Terminal multiplexer

# Editors
brew "neovim"

# Git & GitHub
brew "gh"                # GitHub CLI

# Cloud & Infrastructure
brew "awscli"            # AWS CLI
brew "granted"           # AWS role switching
brew "kubernetes-cli"    # kubectl
brew "kubectx"           # Switch k8s context/namespace
brew "k9s"               # K8s TUI
brew "helm"              # Kubernetes package manager
brew "eksctl"            # EKS cluster management
brew "opentofu"          # Terraform alternative
brew "terraform-docs"
brew "tflint"            # Terraform/OpenTofu linter
brew "trivy"             # Security scanner for containers/IaC
brew "infisical"         # Secret management
brew "docker"
brew "docker-completion"

# Languages & Package Managers
brew "go"
brew "python@3.13"
brew "uv"                # Fast Python package manager

# Keyboard & System
brew "kanata"            # Keyboard remapping
brew "sketchybar"        # Custom macOS menu bar

# Git Tools
brew "lazygit"           # Terminal UI for git
brew "git-delta"         # Better git diffs

# Dev Environment
brew "direnv"            # Per-project env vars
brew "mise"              # Runtime version manager

# Utilities
brew "lazydocker"        # Terminal UI for Docker
brew "gnu-sed"           # GNU sed (macOS ships BSD sed)
brew "btop"              # Terminal system monitor
brew "tldr"              # Simplified man pages
brew "wget"
brew "pandoc"            # Document converter
brew "p7zip"

# Casks - Desktop Apps
cask "aerospace"         # Tiling window manager
cask "alt-tab"           # Windows-style alt-tab
cask "firefox"
cask "bitwarden"         # Password manager
cask "claude-code"
cask "conductor"
cask "cursor"            # AI code editor
cask "visual-studio-code"
cask "deezer"            # Music
cask "ghostty"           # Terminal
cask "google-drive"
cask "homerow"           # Keyboard navigation for macOS
cask "notion-calendar"
cask "raycast"           # Launcher
cask "shottr"            # Screenshots
cask "signal"
cask "whatsapp"

# Fonts
cask "font-jetbrains-mono-nerd-font"
